blog/2016-06-18-centos系统安装.org
#+TITLE: CentOS系统安装
#+DATE: 2016-06-18
#+SETUPFILE: ~/myblog/setupfile.org
#+JEKYLL_LAYOUT: post
#+JEKYLL_CATEGORIES: Linux
#+JEKYLL_TAGS: Linux 运维 CentOS
#+JEKYLL_PUBLISHED: true

描述CentOS光盘的安装程序安装CentOS的过程，包括其bootloader、anaconda的相关配置，以及如何使用光盘的命令行模式，描述了kickstart配置文件的编写，最后简单记录如何去制作引导光盘。




-----
* CentOS安装程序启动过程
1. bootloader: =isolinux/boot.cat=
2. stage2: =isolinux/isolinux.bin=
   - 配置文件: =isolinux/isolinux.cfg=
     #+BEGIN_SRC conf
     # 光盘配置文件中的救援模式
     label rescue  # 命令行提示符下的执行命令
       menu label ^Rescue installed system  # 菜单下显示的内容
       menu default  # 默认的选择项
       kernel vmlinuz  # 加载内核
       append initrd=initrd.img rescue  # 内核参数
     #+END_SRC
   - 命令行提示符下
     #+BEGIN_SRC conf
     boot: linux text  # 使用配置文件中的linux标签，并为内核添加参数text
     # 该命令显式指定使用tui接口
     #+END_SRC
3. 装载根文件系统，并启动anaconda
   - anaconda是系统安装程序
     - tui: 基于curses的文本窗口(需要添加text参数)
     - gui：图形窗口(默认)
     - anaconda及其安装用到的程序包可以位于多种位置上
* 安装引导选项
- boot: 添加在label名后
  - text: 文本安装方式
  - method: 手动指定使用的安装方法
  - 设置与网络相关的引导选项
    - ip=IPADDR
    - netmask=MASK
    - gateway=GW
    - dns=DNS_SERVER_IP
    - ifname=NAME:MAC_ADDR
  - 与远程访问功能相关的引导选项：
    - vnc: 使其他电脑可以远程连接到当前主机
    - vncpassword='PASSWORD'
  - 指明kickstart文件的位置
    - DVD drive: =ks=cdrom:/PATH/TO/KICKSTART_FILE=
    - Hard drive: =ks=hd:/device/drectory/KICKSTART_FILE=
    - HTTP server: =ks=http://host:port/path/to/KICKSTART_FILE=
    - FTP server: =ks=ftp://host:port/path/to/KICKSTART_FILE=
    - HTTPS server: =ks=https://host:port/path/to/KICKSTART_FILE=
  - 启动紧急救援模式：
    - rescue
- 官方文档：《Installation Guide》
* anaconda
** anaconda安装过程
1. 安装前配置阶段
   - 安装过程使用的语言
   - 键盘类型
   - 安装目标存储设备
     - Basic Storage：本地磁盘
     - 特种设备：iSCSI
   - 设定主机名
   - 配置网络接口
   - 时区
   - 管理员密码
   - 设定分区方式及MBR的安装位置					
   - 创建一个普通用户			
   - 选定要安装的程序包
2. 安装阶段
   - 在目标磁盘创建分区，执行格式化操作等
   - 将选定的程序包安装至目标位置
   - 安装bootloader
3. 首次启动
   - iptables
   - selinux
   - core dump
** anaconda的配置方式
1. 交互式配置方式
2. 通过读取事先给定的配置文件自动完成配置: kickstart文件
** kickstart文件
*** ks文件的分段
- 命令段 ::
  ks文件用于指名anaconda安装前的配置
- 程序包段 :: 
  指明要安装的程序包组或程序包，不安装的程序包等
  #+BEGIN_SRC conf
  %packages  # 开始标识符
  @group_name  # 安装的包组
  package  # 安装的包
  -package  # 不安装的程序包
  %end  # 结束标识符
  #+END_SRC
- 脚本段 :: 
  - %pre: 安装前执行的脚本
  - %post: 安装完成后执行的脚本
  - %end: 脚本内容结束标识符
*** 命令段中的命令
- 必备命令
  - install OR upgrade
  - authconfig: 认证方式配置
    #+BEGIN_SRC conf 
    authconfig --useshadow  --passalgo=sha512
    #+END_SRC
  - bootloader：bootloader的安装位置及相关配置
    #+BEGIN_SRC sh
    bootloader --location=mbr --driveorder=sda --append="crashkernel=auto rhgb quiet"  # 在grub.cfg中向内核传递选项
    #+END_SRC
  - keyboard: 设定键盘类型
  - lang: 语言类型
  - part: 创建分区，升级无需此命令
  - rootpw: 指明root的密码
  - timezone: 时区
- 可选命令
  - text: 文本安装界面
  - network
  - firewall
  - selinux
  - halt/poweroff/reboot: 完成后的操作
  - repo: 而外指定rpm源
  - user：安装完成后为系统创建新用户
  - url: 指明安装源
*** 创建ks文件
- 依据某模板修改
  - CentOS安装后会默认在root目录下放置一个当前系统的ks文件
- 使用创建工具: =system-config-kickstart=
- 检查ks文件的语法错误: =ksvalidator=
* 自定义创建引导光盘
将CentOS光盘中的isolinux复制出来后自行定义修改，然后制作引导光盘，用于网络安装
#+BEGIN_SRC conf
mkisofs -R -J -T -v --no-emul-boot --boot-load-size 4 --boot-info-table -V "CentOS 6.6 x86_64 boot" -b isolinux/isolinux.bin -c isolinux/boot.cat -o /root/boot.iso myiso/
#+END_SRC

