_posts/2016-06-18-centos系统安装.html
---
title: "CentOS系统安装"
date: 2016-06-18
layout: post
categories: 
- Linux
tags: 
- Linux 
- 运维 
- CentOS
published: true
comments: 
---
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgheadline1">1. CentOS安装程序启动过程</a></li>
<li><a href="#orgheadline2">2. 安装引导选项</a></li>
<li><a href="#orgheadline9">3. anaconda</a>
<ul>
<li><a href="#orgheadline3">anaconda安装过程</a></li>
<li><a href="#orgheadline4">anaconda的配置方式</a></li>
<li><a href="#orgheadline8">kickstart文件</a>
<ul>
<li><a href="#orgheadline5">ks文件的分段</a></li>
<li><a href="#orgheadline6">命令段中的命令</a></li>
<li><a href="#orgheadline7">创建ks文件</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#orgheadline10">4. 自定义创建引导光盘</a></li>
</ul>
</div>
</div>
<p>
描述CentOS光盘的安装程序安装CentOS的过程，包括其bootloader、anaconda的相关配置，以及如何使用光盘的命令行模式，描述了kickstart配置文件的编写，最后简单记录如何去制作引导光盘。
</p>




<hr  />
<div id="outline-container-orgheadline1" class="outline-2">
<h2 id="orgheadline1"><span class="section-number-2">1</span> CentOS安装程序启动过程</h2>
<div class="outline-text-2" id="text-1">
<ol class="org-ol">
<li>bootloader: <code>isolinux/boot.cat</code></li>
<li>stage2: <code>isolinux/isolinux.bin</code>
<ul class="org-ul">
<li><p>
配置文件: <code>isolinux/isolinux.cfg</code>
</p>
<div class="org-src-container">

<pre class="src src-conf"><span style="color: #75715E;"># </span><span style="color: #75715E;">&#20809;&#30424;&#37197;&#32622;&#25991;&#20214;&#20013;&#30340;&#25937;&#25588;&#27169;&#24335;</span>
label rescue  <span style="color: #75715E;"># </span><span style="color: #75715E;">&#21629;&#20196;&#34892;&#25552;&#31034;&#31526;&#19979;&#30340;&#25191;&#34892;&#21629;&#20196;</span>
  menu label ^Rescue installed system  <span style="color: #75715E;"># </span><span style="color: #75715E;">&#33756;&#21333;&#19979;&#26174;&#31034;&#30340;&#20869;&#23481;</span>
  menu default  <span style="color: #75715E;"># </span><span style="color: #75715E;">&#40664;&#35748;&#30340;&#36873;&#25321;&#39033;</span>
  kernel vmlinuz  <span style="color: #75715E;"># </span><span style="color: #75715E;">&#21152;&#36733;&#20869;&#26680;</span>
  <span style="color: #FD971F;">append initrd</span>=initrd.img rescue  <span style="color: #75715E;"># </span><span style="color: #75715E;">&#20869;&#26680;&#21442;&#25968;</span>
</pre>
</div></li>
<li><p>
命令行提示符下
</p>
<div class="org-src-container">

<pre class="src src-conf">boot: linux text  <span style="color: #75715E;"># </span><span style="color: #75715E;">&#20351;&#29992;&#37197;&#32622;&#25991;&#20214;&#20013;&#30340;linux&#26631;&#31614;&#65292;&#24182;&#20026;&#20869;&#26680;&#28155;&#21152;&#21442;&#25968;text</span>
<span style="color: #75715E;"># </span><span style="color: #75715E;">&#35813;&#21629;&#20196;&#26174;&#24335;&#25351;&#23450;&#20351;&#29992;tui&#25509;&#21475;</span>
</pre>
</div></li>
</ul></li>
<li>装载根文件系统，并启动anaconda
<ul class="org-ul">
<li>anaconda是系统安装程序
<ul class="org-ul">
<li>tui: 基于curses的文本窗口(需要添加text参数)</li>
<li>gui：图形窗口(默认)</li>
<li>anaconda及其安装用到的程序包可以位于多种位置上</li>
</ul></li>
</ul></li>
</ol>
</div>
</div>
<div id="outline-container-orgheadline2" class="outline-2">
<h2 id="orgheadline2"><span class="section-number-2">2</span> 安装引导选项</h2>
<div class="outline-text-2" id="text-2">
<ul class="org-ul">
<li>boot: 添加在label名后
<ul class="org-ul">
<li>text: 文本安装方式</li>
<li>method: 手动指定使用的安装方法</li>
<li>设置与网络相关的引导选项
<ul class="org-ul">
<li>ip=IPADDR</li>
<li>netmask=MASK</li>
<li>gateway=GW</li>
<li>dns=DNS_SERVER_IP</li>
<li>ifname=NAME:MAC_ADDR</li>
</ul></li>
<li>与远程访问功能相关的引导选项：
<ul class="org-ul">
<li>vnc: 使其他电脑可以远程连接到当前主机</li>
<li>vncpassword='PASSWORD'</li>
</ul></li>
<li>指明kickstart文件的位置
<ul class="org-ul">
<li>DVD drive: <code>ks=cdrom:/PATH/TO/KICKSTART_FILE</code></li>
<li>Hard drive: <code>ks=hd:/device/drectory/KICKSTART_FILE</code></li>
<li>HTTP server: <code>ks=http://host:port/path/to/KICKSTART_FILE</code></li>
<li>FTP server: <code>ks=ftp://host:port/path/to/KICKSTART_FILE</code></li>
<li>HTTPS server: <code>ks=https://host:port/path/to/KICKSTART_FILE</code></li>
</ul></li>
<li>启动紧急救援模式：
<ul class="org-ul">
<li>rescue</li>
</ul></li>
</ul></li>
<li>官方文档：《Installation Guide》</li>
</ul>
</div>
</div>
<div id="outline-container-orgheadline9" class="outline-2">
<h2 id="orgheadline9"><span class="section-number-2">3</span> anaconda</h2>
<div class="outline-text-2" id="text-3">
</div><div id="outline-container-orgheadline3" class="outline-3">
<h3 id="orgheadline3">anaconda安装过程</h3>
<div class="outline-text-3" id="text-orgheadline3">
<ol class="org-ol">
<li>安装前配置阶段
<ul class="org-ul">
<li>安装过程使用的语言</li>
<li>键盘类型</li>
<li>安装目标存储设备
<ul class="org-ul">
<li>Basic Storage：本地磁盘</li>
<li>特种设备：iSCSI</li>
</ul></li>
<li>设定主机名</li>
<li>配置网络接口</li>
<li>时区</li>
<li>管理员密码</li>
<li>设定分区方式及MBR的安装位置</li>
<li>创建一个普通用户</li>
<li>选定要安装的程序包</li>
</ul></li>
<li>安装阶段
<ul class="org-ul">
<li>在目标磁盘创建分区，执行格式化操作等</li>
<li>将选定的程序包安装至目标位置</li>
<li>安装bootloader</li>
</ul></li>
<li>首次启动
<ul class="org-ul">
<li>iptables</li>
<li>selinux</li>
<li>core dump</li>
</ul></li>
</ol>
</div>
</div>
<div id="outline-container-orgheadline4" class="outline-3">
<h3 id="orgheadline4">anaconda的配置方式</h3>
<div class="outline-text-3" id="text-orgheadline4">
<ol class="org-ol">
<li>交互式配置方式</li>
<li>通过读取事先给定的配置文件自动完成配置: kickstart文件</li>
</ol>
</div>
</div>
<div id="outline-container-orgheadline8" class="outline-3">
<h3 id="orgheadline8">kickstart文件</h3>
<div class="outline-text-3" id="text-orgheadline8">
</div><div id="outline-container-orgheadline5" class="outline-4">
<h4 id="orgheadline5">ks文件的分段</h4>
<div class="outline-text-4" id="text-orgheadline5">
<dl class="org-dl">
<dt>命令段</dt><dd>ks文件用于指名anaconda安装前的配置</dd>
<dt>程序包段</dt><dd><p>
  指明要安装的程序包组或程序包，不安装的程序包等
</p>
<div class="org-src-container">

<pre class="src src-conf">%packages  <span style="color: #75715E;"># </span><span style="color: #75715E;">&#24320;&#22987;&#26631;&#35782;&#31526;</span>
@group_name  <span style="color: #75715E;"># </span><span style="color: #75715E;">&#23433;&#35013;&#30340;&#21253;&#32452;</span>
package  <span style="color: #75715E;"># </span><span style="color: #75715E;">&#23433;&#35013;&#30340;&#21253;</span>
-package  <span style="color: #75715E;"># </span><span style="color: #75715E;">&#19981;&#23433;&#35013;&#30340;&#31243;&#24207;&#21253;</span>
%end  <span style="color: #75715E;"># </span><span style="color: #75715E;">&#32467;&#26463;&#26631;&#35782;&#31526;</span>
</pre>
</div></dd>
<dt>脚本段</dt><dd><ul class="org-ul">
<li>%pre: 安装前执行的脚本</li>
<li>%post: 安装完成后执行的脚本</li>
<li>%end: 脚本内容结束标识符</li>
</ul></dd>
</dl>
</div>
</div>
<div id="outline-container-orgheadline6" class="outline-4">
<h4 id="orgheadline6">命令段中的命令</h4>
<div class="outline-text-4" id="text-orgheadline6">
<ul class="org-ul">
<li>必备命令
<ul class="org-ul">
<li>install OR upgrade</li>
<li><p>
authconfig: 认证方式配置
</p>
<div class="org-src-container">

<pre class="src src-conf"><span style="color: #FD971F;">authconfig --useshadow  --passalgo</span>=sha512
</pre>
</div></li>
<li><p>
bootloader：bootloader的安装位置及相关配置
</p>
<div class="org-src-container">

<pre class="src src-sh">bootloader --location=mbr --driveorder=sda --append=<span style="color: #E6DB74;">"crashkernel=auto rhgb quiet"</span>  <span style="color: #75715E;"># </span><span style="color: #75715E;">&#22312;grub.cfg&#20013;&#21521;&#20869;&#26680;&#20256;&#36882;&#36873;&#39033;</span>
</pre>
</div></li>
<li>keyboard: 设定键盘类型</li>
<li>lang: 语言类型</li>
<li>part: 创建分区，升级无需此命令</li>
<li>rootpw: 指明root的密码</li>
<li>timezone: 时区</li>
</ul></li>
<li>可选命令
<ul class="org-ul">
<li>text: 文本安装界面</li>
<li>network</li>
<li>firewall</li>
<li>selinux</li>
<li>halt/poweroff/reboot: 完成后的操作</li>
<li>repo: 而外指定rpm源</li>
<li>user：安装完成后为系统创建新用户</li>
<li>url: 指明安装源</li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-orgheadline7" class="outline-4">
<h4 id="orgheadline7">创建ks文件</h4>
<div class="outline-text-4" id="text-orgheadline7">
<ul class="org-ul">
<li>依据某模板修改
<ul class="org-ul">
<li>CentOS安装后会默认在root目录下放置一个当前系统的ks文件</li>
</ul></li>
<li>使用创建工具: <code>system-config-kickstart</code></li>
<li>检查ks文件的语法错误: <code>ksvalidator</code></li>
</ul>
</div>
</div>
</div>
</div>
<div id="outline-container-orgheadline10" class="outline-2">
<h2 id="orgheadline10"><span class="section-number-2">4</span> 自定义创建引导光盘</h2>
<div class="outline-text-2" id="text-4">
<p>
将CentOS光盘中的isolinux复制出来后自行定义修改，然后制作引导光盘，用于网络安装
</p>
<div class="org-src-container">

<pre class="src src-conf">mkisofs -R -J -T -v --no-emul-boot --boot-load-size 4 --boot-info-table -V <span style="color: #E6DB74;">"CentOS 6.6 x86_64 boot"</span> -b isolinux/isolinux.bin -c isolinux/boot.cat -o /root/boot.iso myiso/
</pre>
</div>
</div>
</div>
